# PANDAS

## SERİLER

In [1]:
import pandas as pd
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [2]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [3]:
veri = pd.Series([10, 25, -5, 35])

In [4]:
veri.values

array([10, 25, -5, 35], dtype=int64)

In [5]:
veri.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

Sözlüklerle beraber kullanılabilirler

In [7]:
import pandas as pd
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
s

a    0.0
b    1.0
c    2.0
dtype: float64

In [8]:
import pandas as pd
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
s

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [9]:
data['a']

0.0

**Serilerle ilgili Çalışmalar**

In [10]:
veri = pd.Series([10, 2, -5, 3], index=['d', 'b', 'a', 'c'])
veri

d    10
b     2
a    -5
c     3
dtype: int64

In [11]:
veri['d'] = 6
veri[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

Numpy benzeri boolen değerlerle filtreleme yapılabilir

In [12]:
veri[veri > 0]

d    6
b    2
c    3
dtype: int64

Matematiksel aritmetik işlemler yapılabilir

In [13]:
print(veri * 2)
print(veri+2)
print(veri-3)
print(veri/2)

d    12
b     4
a   -10
c     6
dtype: int64
d    8
b    4
a   -3
c    5
dtype: int64
d    3
b   -1
a   -8
c    0
dtype: int64
d    3.0
b    1.0
a   -2.5
c    1.5
dtype: float64

numpy ile kullanılabilir

In [14]:
import numpy as np
np.exp(veri)

d    403.428793
b      7.389056
a      0.006738
c     20.085537
dtype: float64

veri kontrolu yapılabilir

In [15]:
"a" in veri

True

In [16]:
"e" in veri

False

Pandasta eksik bilgiler NAN olarak adlandırılır

In [17]:
sdata = {'Ankara': 35000, 'İzmir': 71000, 'Van': 16000, 'Aydın': 5000}
obj3 = pd.Series(sdata)
obj3

Ankara    35000
Aydın      5000
Van       16000
İzmir     71000
dtype: int64

In [18]:
states = ['Ankara', 'Van', 'Aydın', 'Manisa']
obj4 = pd.Series(sdata, index=states)
obj4

Ankara    35000.0
Van       16000.0
Aydın      5000.0
Manisa        NaN
dtype: float64

In [19]:
pd.isnull(obj4)

Ankara    False
Van       False
Aydın     False
Manisa     True
dtype: bool

In [20]:
pd.notnull(obj4)

Ankara     True
Van        True
Aydın      True
Manisa    False
dtype: bool

## DATAFRAME

Yapısı şöyledir **pandas.DataFrame( data, index, columns, dtype, copy)**

In [21]:
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

Liste ullanarak DataFrame oluşturulabilir

In [22]:
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [23]:
import pandas as pd
data = [['İbrahim',20],['Turgay',22],['Kubilay',23]]
df = pd.DataFrame(data,columns=['Ad','Yaş'])
df

        Ad  Yaş
0  İbrahim   20
1   Turgay   22
2  Kubilay   23

Szölük kullanılarak DataFrame oluşturulabilir

In [24]:
import pandas as pd
dict = {"Ülke": ["Brazil", "Russia", "India", "China", "South Africa"],
       "Başkent": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "Alan": [8.516, 17.10, 3.286, 9.597, 1.221],
       "nüfus": [200.4, 143.5, 1252, 1357, 52.98] }

data = pd.DataFrame(dict)
print(data)

     Alan    Başkent    nüfus          Ülke
0   8.516   Brasilia   200.40        Brazil
1  17.100     Moscow   143.50        Russia
2   3.286  New Dehli  1252.00         India
3   9.597    Beijing  1357.00         China
4   1.221   Pretoria    52.98  South Africa

In [25]:
data.index = ["BR", "RU", "IN", "CH", "SA"]
data

      Alan    Başkent    nüfus          Ülke
BR   8.516   Brasilia   200.40        Brazil
RU  17.100     Moscow   143.50        Russia
IN   3.286  New Dehli  1252.00         India
CH   9.597    Beijing  1357.00         China
SA   1.221   Pretoria    52.98  South Africa

In [26]:
data["Alan"]

BR     8.516
RU    17.100
IN     3.286
CH     9.597
SA     1.221
Name: Alan, dtype: float64

In [27]:
data["Başkent"]

BR     Brasilia
RU       Moscow
IN    New Dehli
CH      Beijing
SA     Pretoria
Name: Başkent, dtype: object

In [28]:
data.Alan

BR     8.516
RU    17.100
IN     3.286
CH     9.597
SA     1.221
Name: Alan, dtype: float64

Satır içerisindeki değererede erişebilmek için loc kullanılır

In [29]:
data.loc["BR"]

Alan          8.516
Başkent    Brasilia
nüfus         200.4
Ülke         Brazil
Name: BR, dtype: object

In [30]:
data.loc["RU"]

Alan         17.1
Başkent    Moscow
nüfus       143.5
Ülke       Russia
Name: RU, dtype: object

boş bir frame oluşturulabilir ve istenilen değerler sonradan eklenebilir

In [31]:
veri2 = pd.DataFrame(data, columns=['yıl', 'bolge', 'nufus', 'yogunluk'],
                      index=['bir', 'iki', 'uc', 'dort','bes', 'altı'])
veri2

      yıl  bolge  nufus  yogunluk
bir   NaN    NaN    NaN       NaN
iki   NaN    NaN    NaN       NaN
uc    NaN    NaN    NaN       NaN
dort  NaN    NaN    NaN       NaN
bes   NaN    NaN    NaN       NaN
altı  NaN    NaN    NaN       NaN

belli bir sayı verilebilir

In [32]:
veri2['yogunluk'] = 16.5
veri2

      yıl  bolge  nufus  yogunluk
bir   NaN    NaN    NaN      16.5
iki   NaN    NaN    NaN      16.5
uc    NaN    NaN    NaN      16.5
dort  NaN    NaN    NaN      16.5
bes   NaN    NaN    NaN      16.5
altı  NaN    NaN    NaN      16.5

bir numpy dizisi ile belli bir aralıktan başlanabilir

In [33]:
import numpy as np
veri2['yogunluk'] = np.arange(6.)
veri2

      yıl  bolge  nufus  yogunluk
bir   NaN    NaN    NaN       0.0
iki   NaN    NaN    NaN       1.0
uc    NaN    NaN    NaN       2.0
dort  NaN    NaN    NaN       3.0
bes   NaN    NaN    NaN       4.0
altı  NaN    NaN    NaN       5.0

In [34]:
val = pd.Series([-1.2, -1.5, -1.7], index=['iki', 'dort', 'bes'])
veri2['yogunluk'] = val
veri2

      yıl  bolge  nufus  yogunluk
bir   NaN    NaN    NaN       NaN
iki   NaN    NaN    NaN      -1.2
uc    NaN    NaN    NaN       NaN
dort  NaN    NaN    NaN      -1.5
bes   NaN    NaN    NaN      -1.7
altı  NaN    NaN    NaN       NaN

yeni bir sütun oluşturulabilir

In [35]:
veri2["yeni_sütun"]=[5,23,34,45,56,45]
veri2

      yıl  bolge  nufus  yogunluk  yeni_sütun
bir   NaN    NaN    NaN       NaN           5
iki   NaN    NaN    NaN      -1.2          23
uc    NaN    NaN    NaN       NaN          34
dort  NaN    NaN    NaN      -1.5          45
bes   NaN    NaN    NaN      -1.7          56
altı  NaN    NaN    NaN       NaN          45

Transpoz alınarak satır ve sütunların yerleri değiştirilebilir

In [36]:
nufus = {'Ankara': {2001: 2.4, 2002: 2.9},
       'İzmir': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [37]:
veri3 = pd.DataFrame(nufus)
veri3

      Ankara  İzmir
2000     NaN    1.5
2001     2.4    1.7
2002     2.9    3.6

In [38]:
veri3.T

        2000  2001  2002
Ankara   NaN   2.4   2.9
İzmir    1.5   1.7   3.6

sözlük yapısındaki anahtar index olarak verilebilir şayet bir index belirtilmemişse

In [39]:
pd.DataFrame(nufus, index=[2001, 2002, 2003])

      Ankara  İzmir
2001     2.4    1.7
2002     2.9    3.6
2003     NaN    NaN

In [40]:
pdata = {'Ankara': veri3['Ankara'][:-1],
         'İzmir': veri3['İzmir'][:2]}
pd.DataFrame(pdata)

      Ankara  İzmir
2000     NaN    1.5
2001     2.4    1.7

In [41]:
veri3.index.name = 'yil'; veri3.columns.name = 'bolge'
veri3

bolge  Ankara  İzmir
yil
2000      NaN    1.5
2001      2.4    1.7
2002      2.9    3.6

In [42]:
veri3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

## Temel Fonksiyonlar

reindex ile varolan index düzelenir yeni bir index sırası düzenlenir

In [43]:
veri1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
veri1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [44]:
veri2 = veri1.reindex(['a', 'b', 'c', 'd', 'e'])
veri2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

ffill metodu kullanarak indeksi verilen bir aralıktaki tüm eksik değerler belirlenen değerler atanır

In [45]:
veri3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
veri3
veri3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

numpy verisi ile değer atanabilir

In [46]:
veri4 = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
veri4

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [47]:
veri5 = veri4.reindex(['a', 'b', 'c', 'd'])
veri5

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

## SİLME İŞLEMİ

tek bir sütun veya belli aralıktaki sütun ve satırlar drop ile silinir

In [48]:
veri = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
veri

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [49]:
yeni_veri = veri.drop('c')
yeni_veri

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [50]:
veri

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [51]:
veri2 = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Aydın', 'İzmir', 'Van', 'Ankara'],
                    columns=['bir', 'iki', 'uc', 'dort'])
veri2

        bir  iki  uc  dort
Aydın     0    1   2     3
İzmir     4    5   6     7
Van       8    9  10    11
Ankara   12   13  14    15

In [52]:
veri2.drop(['Aydın', 'Van'])

        bir  iki  uc  dort
İzmir     4    5   6     7
Ankara   12   13  14    15

In [53]:
veri2.drop('iki', axis=1)

        bir  uc  dort
Aydın     0   2     3
İzmir     4   6     7
Van       8  10    11
Ankara   12  14    15

In [54]:
veri2.drop(['iki', 'dort'], axis='columns')

        bir  uc
Aydın     0   2
İzmir     4   6
Van       8  10
Ankara   12  14

inplace ile veri tamamen silinir

In [55]:
veri.drop('c', inplace=True)
veri

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

## İndexleme,Seçme ve Filtreleme

In [56]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [57]:
obj["b"]

1.0

In [58]:
obj[3]

3.0

In [59]:
obj[2:5]

c    2.0
d    3.0
dtype: float64

In [60]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [61]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [62]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [63]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [64]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [67]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [68]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

belli bir sayıdan büyük olanlar listelenebilir

In [69]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [71]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

**loc ve iloc ile seçim**

bir satırın belli aralıktaki sütunları listelenebilir

loc Label alırken

iloc numerik bir dizi gibi davranır

In [72]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [73]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

belli bir aralığa kadar olan satırların belirli bir sütunu listelenebilir

In [74]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [75]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## VERİ HİZALAMA

In [76]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
print(s1)
print(s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [77]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [78]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1)
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [79]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [80]:
df1 = pd.DataFrame({'A': [1, 2,0]})
df2 = pd.DataFrame({'B': [3, 4,5]})
df1

   A
0  1
1  2
2  0

In [81]:
df2

   B
0  3
1  4
2  5

In [82]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN

In [83]:
df1.add(df2, fill_value=0)

     A    B
0  1.0  3.0
1  2.0  4.0
2  0.0  5.0

In [84]:
1 / df1

          A
0  1.000000
1  0.500000
2       inf

In [85]:
df1.rdiv(2)

          A
0  2.000000
1  1.000000
2       inf

## SIRALAMA

In [86]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [87]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [88]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [89]:
frame.sort_index(axis=1, ascending=True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [90]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [91]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

## Tablosal bir veri dosyası pandas kullanarak nasıl okunur

## "Örnek Bir Veri okuma"

In [98]:
data=pd.read_excel("Turkey-Cities.xlsx")

In [99]:
data

,Plaka numarası,Ad,Latin,Enlem,Boylam,alan (km2),nüfus (2000-tuik)
0,1,Adana,Adana,37000,35320,14 25622,1849478
1,2,Adıyaman,Adiyaman,37770,38280,7 572,623811
2,3,Afyonkarahisar,Afyonkarahisar,38770,30540,14 532,812416
3,4,Ağrı,Agri,39465,43387,11 315,528744
4,5,Amasya,Amasya,40650,35830,5 731,365231
5,6,Ankara,Ankara,39930,32850,25 615,4007860
6,7,Antalya,Antalya,36890,30710,20 599,1719751
7,8,Artvin,Artvin,41190,41820,7 493,191934
8,9,Aydın,Aydin,37860,27840,7 922,950757
9,10,Balıkesir,Balikesir,39650,27880,14 442,1076347
10,11,Bilecik,Bilecik,40160,29980,4 181,194326
11,12,Bingöl,Bingol,38890,40490,8 402,253739
12,13,Bitlis,Bitlis,38430,42140,8 413,388678
13,14,Bolu,Bolu,40750,31610,10 716,270654
14,15,Burdur,Burdur,37730,30280,7 238,256803
15,16,Bursa,Bursa,40200,29080,11 087,2125140
16,17,Çanakkale,Canakkale,40160,26410,9 887,464975
17,18,Çankırı,Cankiri,40610,33620,8 411,270355
18,19,Çorum,Corum,40560,34960,12 833,597065
19,20,Denizli,Denizli,37780,29080,11 716,850029
20,21,Diyarbakır,Diyarbakir,37920,40230,15 162,1362708
21,22,Edirne,Edirne,41690,26560,6 241,402606
22,23,Elazığ,Elazig,38680,39230,9 181,569616
23,24,Erzincan,Erzincan,39740,39500,11 974,316841
24,25,Erzurum,Erzurum,39910,41290,24 741,937389
25,26,Eskişehir,Eskisehir,39790,30520,13 904,706009
26,27,Gaziantep,Gaziantep,37070,37390,7 194,1285249
27,28,Giresun,Giresun,40920,38390,7 151,523819
28,29,Gümüşhane,Gumushane,40460,39480,6 125,186953
29,30,Hakkari,Hakkari,37570,43750,7 729,236581
...,...,...,...,...,...,...,...
51,52,Ordu,Ordu,40990,37880,5 894,887765
52,53,Rize,Rize,41020,40520,3 792,365938
53,54,Sakarya,Sakarya,40735,30383,4 895,756168
54,55,Samsun,Samsun,41290,36330,9 474,1209137
55,56,Siirt,Siirt,37940,41950,5 465,263676
56,57,Sinop,Sinop,42030,35150,5 858,225574
57,58,Sivas,Sivas,39750,37020,28 129,755091
58,59,Tekirdağ,Tekirdag,40980,27520,6 345,623591
59,60,Tokat,Tokat,40300,36560,9 912,828027
60,61,Trabzon,Trabzon,41000,39710,4 495,975137
61,62,Tunceli,Tunceli,39100,39550,7 406,93584
62,63,Şanlıurfa,Sanliurfa,37170,38790,19 091,1443422
63,64,Uşak,Usak,38680,29410,5 174,322313
64,65,Van,Van,38490,43400,20 927,877524
65,66,Yozgat,Yozgat,39820,34810,14 083,682919
66,67,Zonguldak,Zonguldak,41460,31800,3 470,615599
67,68,Aksaray,Aksaray,38370,34030,8 051,396084
68,69,Bayburt,Bayburt,40260,40220,4 043,97358
69,70,Karaman,Karaman,37180,33220,8 816,243210
70,71,Kırıkkale,Kirikkale,39850,33520,4 5895,383508
71,72,Batman,Batman,37890,41130,4 671,456734
72,73,Şırnak,Sirnak,37520,42460,7 296,353197
73,74,Bartın,Bartin,41650,32340,1 960,184178
74,75,Ardahan,Ardahan,41122,42896,5 495,133756
75,76,Iğdır,Igdir,39920,44060,3 584,168634
76,77,Yalova,Yalova,40660,29280,403,168593
77,78,Karabük,Karabuk,41210,32610,2 864,225102
78,79,Kilis,Kilis,36730,37110,1 239,114724
79,80,Osmaniye,Osmaniye,37070,36250,3 189,458782
80,81,Düzce,Duzce,40850,31150,1 065,314266

Gözlem: Görüldüğü üzere tablonun ilk 30 ve son 30 satırları gösterilmiştir.

head() yapısı kullanarak istenilen aralıkta satırlar gösterilebilir. Argümansız varsayılan dağer beştir;

In [106]:
data.head()

,Plaka numarası,Ad,Latin,Enlem,Boylam,alan (km2),nüfus (2000-tuik)
0,1,Adana,Adana,37000,35320,14 25622,1849478
1,2,Adıyaman,Adiyaman,37770,38280,7 572,623811
2,3,Afyonkarahisar,Afyonkarahisar,38770,30540,14 532,812416
3,4,Ağrı,Agri,39465,43387,11 315,528744
4,5,Amasya,Amasya,40650,35830,5 731,365231

In [102]:
data.head(12)

,Plaka numarası,Ad,Latin,Enlem,Boylam,alan (km2),nüfus (2000-tuik)
0,1,Adana,Adana,37000,35320,14 25622,1849478
1,2,Adıyaman,Adiyaman,37770,38280,7 572,623811
2,3,Afyonkarahisar,Afyonkarahisar,38770,30540,14 532,812416
3,4,Ağrı,Agri,39465,43387,11 315,528744
4,5,Amasya,Amasya,40650,35830,5 731,365231
5,6,Ankara,Ankara,39930,32850,25 615,4007860
6,7,Antalya,Antalya,36890,30710,20 599,1719751
7,8,Artvin,Artvin,41190,41820,7 493,191934
8,9,Aydın,Aydin,37860,27840,7 922,950757
9,10,Balıkesir,Balikesir,39650,27880,14 442,1076347
10,11,Bilecik,Bilecik,40160,29980,4 181,194326
11,12,Bingöl,Bingol,38890,40490,8 402,253739

In [104]:
data.tail(8)

,Plaka numarası,Ad,Latin,Enlem,Boylam,alan (km2),nüfus (2000-tuik)
73,74,Bartın,Bartin,41650,32340,1 960,184178
74,75,Ardahan,Ardahan,41122,42896,5 495,133756
75,76,Iğdır,Igdir,39920,44060,3 584,168634
76,77,Yalova,Yalova,40660,29280,403,168593
77,78,Karabük,Karabuk,41210,32610,2 864,225102
78,79,Kilis,Kilis,36730,37110,1 239,114724
79,80,Osmaniye,Osmaniye,37070,36250,3 189,458782
80,81,Düzce,Duzce,40850,31150,1 065,314266

#Parantez gösterimini kullanarak 'Ad' serisini seçelim
data['Ad']
#Veya eşdeğeri olarak nokta işaretini kullanabiliriz.
ufo.Ad

In [107]:
data["Ad"]

0              Adana
1           Adıyaman
2     Afyonkarahisar
3               Ağrı
4             Amasya
5             Ankara
6            Antalya
7             Artvin
8              Aydın
9          Balıkesir
10           Bilecik
11            Bingöl
12            Bitlis
13              Bolu
14            Burdur
15             Bursa
16         Çanakkale
17           Çankırı
18             Çorum
19           Denizli
20        Diyarbakır
21            Edirne
22            Elazığ
23          Erzincan
24           Erzurum
25         Eskişehir
26         Gaziantep
27           Giresun
28         Gümüşhane
29           Hakkari
           ...
51              Ordu
52              Rize
53           Sakarya
54            Samsun
55             Siirt
56             Sinop
57             Sivas
58          Tekirdağ
59             Tokat
60           Trabzon
61           Tunceli
62         Şanlıurfa
63              Uşak
64               Van
65            Yozgat
66         Zonguldak
67           Aksaray
68           Bayburt
69           Karaman
70         Kırıkkale
71            Batman
72            Şırnak
73            Bartın
74           Ardahan
75             Iğdır
76            Yalova
77           Karabük
78             Kilis
79          Osmaniye
80             Düzce
Name: Ad, Length: 81, dtype: object

In [108]:
data.Ad

0              Adana
1           Adıyaman
2     Afyonkarahisar
3               Ağrı
4             Amasya
5             Ankara
6            Antalya
7             Artvin
8              Aydın
9          Balıkesir
10           Bilecik
11            Bingöl
12            Bitlis
13              Bolu
14            Burdur
15             Bursa
16         Çanakkale
17           Çankırı
18             Çorum
19           Denizli
20        Diyarbakır
21            Edirne
22            Elazığ
23          Erzincan
24           Erzurum
25         Eskişehir
26         Gaziantep
27           Giresun
28         Gümüşhane
29           Hakkari
           ...
51              Ordu
52              Rize
53           Sakarya
54            Samsun
55             Siirt
56             Sinop
57             Sivas
58          Tekirdağ
59             Tokat
60           Trabzon
61           Tunceli
62         Şanlıurfa
63              Uşak
64               Van
65            Yozgat
66         Zonguldak
67           Aksaray
68           Bayburt
69           Karaman
70         Kırıkkale
71            Batman
72            Şırnak
73            Bartın
74           Ardahan
75             Iğdır
76            Yalova
77           Karabük
78             Kilis
79          Osmaniye
80             Düzce
Name: Ad, Length: 81, dtype: object

In [109]:
data=pd.read_excel("Turkey-Cities.xlsx", header=None)
data

,0,1,2,3,4,5,6
0,Plaka numarası,Ad,Latin,Enlem,Boylam,alan (km2),nüfus (2000-tuik)
1,1,Adana,Adana,37000,35320,14 25622,1849478
2,2,Adıyaman,Adiyaman,37770,38280,7 572,623811
3,3,Afyonkarahisar,Afyonkarahisar,38770,30540,14 532,812416
4,4,Ağrı,Agri,39465,43387,11 315,528744
5,5,Amasya,Amasya,40650,35830,5 731,365231
6,6,Ankara,Ankara,39930,32850,25 615,4007860
7,7,Antalya,Antalya,36890,30710,20 599,1719751
8,8,Artvin,Artvin,41190,41820,7 493,191934
9,9,Aydın,Aydin,37860,27840,7 922,950757
10,10,Balıkesir,Balikesir,39650,27880,14 442,1076347
11,11,Bilecik,Bilecik,40160,29980,4 181,194326
12,12,Bingöl,Bingol,38890,40490,8 402,253739
13,13,Bitlis,Bitlis,38430,42140,8 413,388678
14,14,Bolu,Bolu,40750,31610,10 716,270654
15,15,Burdur,Burdur,37730,30280,7 238,256803
16,16,Bursa,Bursa,40200,29080,11 087,2125140
17,17,Çanakkale,Canakkale,40160,26410,9 887,464975
18,18,Çankırı,Cankiri,40610,33620,8 411,270355
19,19,Çorum,Corum,40560,34960,12 833,597065
20,20,Denizli,Denizli,37780,29080,11 716,850029
21,21,Diyarbakır,Diyarbakir,37920,40230,15 162,1362708
22,22,Edirne,Edirne,41690,26560,6 241,402606
23,23,Elazığ,Elazig,38680,39230,9 181,569616
24,24,Erzincan,Erzincan,39740,39500,11 974,316841
25,25,Erzurum,Erzurum,39910,41290,24 741,937389
26,26,Eskişehir,Eskisehir,39790,30520,13 904,706009
27,27,Gaziantep,Gaziantep,37070,37390,7 194,1285249
28,28,Giresun,Giresun,40920,38390,7 151,523819
29,29,Gümüşhane,Gumushane,40460,39480,6 125,186953
...,...,...,...,...,...,...,...
52,52,Ordu,Ordu,40990,37880,5 894,887765
53,53,Rize,Rize,41020,40520,3 792,365938
54,54,Sakarya,Sakarya,40735,30383,4 895,756168
55,55,Samsun,Samsun,41290,36330,9 474,1209137
56,56,Siirt,Siirt,37940,41950,5 465,263676
57,57,Sinop,Sinop,42030,35150,5 858,225574
58,58,Sivas,Sivas,39750,37020,28 129,755091
59,59,Tekirdağ,Tekirdag,40980,27520,6 345,623591
60,60,Tokat,Tokat,40300,36560,9 912,828027
61,61,Trabzon,Trabzon,41000,39710,4 495,975137
62,62,Tunceli,Tunceli,39100,39550,7 406,93584
63,63,Şanlıurfa,Sanliurfa,37170,38790,19 091,1443422
64,64,Uşak,Usak,38680,29410,5 174,322313
65,65,Van,Van,38490,43400,20 927,877524
66,66,Yozgat,Yozgat,39820,34810,14 083,682919
67,67,Zonguldak,Zonguldak,41460,31800,3 470,615599
68,68,Aksaray,Aksaray,38370,34030,8 051,396084
69,69,Bayburt,Bayburt,40260,40220,4 043,97358
70,70,Karaman,Karaman,37180,33220,8 816,243210
71,71,Kırıkkale,Kirikkale,39850,33520,4 5895,383508
72,72,Batman,Batman,37890,41130,4 671,456734
73,73,Şırnak,Sirnak,37520,42460,7 296,353197
74,74,Bartın,Bartin,41650,32340,1 960,184178
75,75,Ardahan,Ardahan,41122,42896,5 495,133756
76,76,Iğdır,Igdir,39920,44060,3 584,168634
77,77,Yalova,Yalova,40660,29280,403,168593
78,78,Karabük,Karabuk,41210,32610,2 864,225102
79,79,Kilis,Kilis,36730,37110,1 239,114724
80,80,Osmaniye,Osmaniye,37070,36250,3 189,458782
81,81,Düzce,Duzce,40850,31150,1 065,314266

## Sütunlarla İlgili Çeşitli Manipülasyonlar

Amerikada bazı eyaletler de görülen Ufo olarak görüldüğü zannedilen bazı cisimlerin renk ve şekillerinin kaydedildiği bir tablo incelensin

In [110]:
#Bir DataFrame içine UFO raporlarının bir veri kümesini okuyoruz
ufo = pd.read_table('http://bit.ly/uforeports')
ufo.head()

   City,Colors Reported,Shape Reported,State,Time
0              Ithaca,,TRIANGLE,NY,6/1/1930 22:00
1           Willingboro,,OTHER,NJ,6/30/1930 20:00
2                Holyoke,,OVAL,CO,2/15/1931 14:00
3                 Abilene,,DISK,KS,6/1/1931 13:00
4  New York Worlds Fair,,LIGHT,NY,4/18/1933 19:00

Gözlem: Görüldüğü üzere Tabloda şekil bozukluğu mevcuttur sütunların virgülden ayrılması gerekir. Bunun için sep kullanılır

In [111]:
#Bir DataFrame içine UFO raporlarının bir veri kümesini okuyoruz
ufo = pd.read_table('http://bit.ly/uforeports', sep=',')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [114]:
yeni_ufo = ['City', 'State', 'Colors Reported','Shape Reported','Time']
#Başlıkları user_cols dizisi olarak değiştiriyoruz.
data = pd.read_table('http://bit.ly/uforeports', sep=',',  names=yeni_ufo)

In [113]:
data.head()

,City,State,Colors Reported,Shape Reported,Time
0,City,Colors Reported,Shape Reported,State,Time
1,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
2,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
3,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
4,Abilene,NaN,DISK,KS,6/1/1931 13:00

In [115]:
#Yeni bir 'Location' serisi yaratalım.
#(Seri adı tanımlamak için köşeli ayraç gösterimi kullanılmalıdır.)
ufo['Yen_Lokasyon'] = ufo.City + ', ' + ufo.State
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Yen_Lokasyon
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

Pandas ile Sütun adlarını değiştirebiliriz

In [116]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Yen_Lokasyon'],
      dtype='object')

In [117]:
#'rename' metodu kullanrak iki sütunun adlarını değiştirelim
ufo.rename(columns={'Colors Reported':'Raporlanan Renk','Shape Reported':'Raporlanan Şekil'},inplace=True)
ufo.columns

Index(['City', 'Raporlanan Renk', 'Raporlanan Şekil', 'State', 'Time',
       'Yen_Lokasyon'],
      dtype='object')

In [118]:
ufo.head()

,City,Raporlanan Renk,Raporlanan Şekil,State,Time,Yen_Lokasyon
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

## İstatistikler

In [120]:
# read the drinks dataset into a DataFrame
drinks = pd.read_csv('http://bit.ly/drinksbycountry', index_col='country')
drinks.head(12)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa
Antigua & Barbuda,102,128,45,4.9,North America
Argentina,193,25,221,8.3,South America
Armenia,21,179,11,3.8,Europe
Australia,261,72,212,10.4,Oceania
Austria,279,75,191,9.7,Europe
Azerbaijan,21,46,5,1.3,Europe
Bahamas,122,176,51,6.3,North America

In [121]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [122]:
drinks.max()

beer_servings                             376
spirit_servings                           438
wine_servings                             370
total_litres_of_pure_alcohol             14.4
continent                       South America
dtype: object

In [123]:
drinks.min()

beer_servings                        0
spirit_servings                      0
wine_servings                        0
total_litres_of_pure_alcohol         0
continent                       Africa
dtype: object

In [124]:
drinks.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

In [125]:
drinks.median()

beer_servings                   76.0
spirit_servings                 56.0
wine_servings                    8.0
total_litres_of_pure_alcohol     4.2
dtype: float64

In [126]:
drinks.continent.unique()

array(['Asia', 'Europe', 'Africa', 'North America', 'South America',
       'Oceania'], dtype=object)